controllers/SiteController.php

SELECT * FROM `coordinates` ORDER BY `user_id`
---
    public function actionGetCoords(){
        $model = Coordinates::find()->orderBy('user_id')->all();

SELECT `users`.* FROM `users` INNER JOIN `coordinates` ON users.id = coordinates.user_id ORDER BY `users`.`id`
---
    public function actionGetUsers(){
        $model = Users::find()->innerJoin('coordinates','users.id = coordinates.user_id')->orderBy('users.id')->all();